app/services/game_runner.rb

SELECT `players`.* FROM `players`
INSERT INTO `players` (`name`, `created_at`, `updated_at`) VALUES ('claudine', '2020-11-13 22:49:42.423016', '2020-11-13 22:49:42.423016')
SELECT `players`.* FROM `players` LIMIT 4
INSERT INTO `games` (`created_at`, `updated_at`) VALUES ('2020-11-13 22:49:42.472423', '2020-11-13 22:49:42.472423')
SELECT `players`.* FROM `players` INNER JOIN `games_players` ON `players`.`id` = `games_players`.`player_id` WHERE `games_players`.`game_id` = 1
---
  def self.setup
    players = ::Player.all.to_a
    players_names = []
    amount_players = rand(2..5)
    if players.length < amount_players
      amount_players.times do
        player_name = Faker::Name.name.split(' ')[0].downcase
        players << Player.create(name: player_name)
        players_names << player_name
      end
    else
      players = ::Player.all.limit(amount_players)
      players.each { |p| players_names << p.name }
    end

    game = Game.create
    game.players = players
    game.save

    cards = Card.all

    players.each do |player|