app/services/game_runner_service.rb

SELECT `players`.* FROM `players`
SELECT `players`.* FROM `players` LIMIT 2
INSERT INTO `games` (`created_at`, `updated_at`) VALUES ('2020-11-14 06:37:11.529924', '2020-11-14 06:37:11.529924')
SELECT `cards`.* FROM `cards`
SELECT `players`.* FROM `players` INNER JOIN `games_players` ON `players`.`id` = `games_players`.`player_id` WHERE `games_players`.`game_id` = 7
---
  def self.setup
    players = ::Player.all.to_a
    players_names = []
    amount_players = rand(2..5)
    if players.length < amount_players
      amount_players.times do
        player_name = Faker::Name.name.split(' ')[0].downcase
        players << Player.create(name: player_name)
        players_names << player_name
      end
    else
      players = ::Player.all.limit(amount_players)
      players.each { |p| players_names << p.name }
    end

    game = Game.create
    game.players = players
    game.save

    cards = Card.all
    deck_a = cards.to_a

    players.each do |player|